data.org
* Index
** Ml
 [[./resources/17/ml.org::Machine Learning][1. Machine Learning]]
   [[./resources/17/ml.org::Supervised Learning][1.2. Supervised Learning]]
   [[./resources/17/ml.org::Linear regression][1.3. Linear regression]]
 [[./resources/17/ml.org::Scikit-learn][2. Scikit-learn]]
   [[./resources/17/ml.org::Univariate Linear Regression][2.2. Univariate Linear Regression]]
   [[./resources/17/ml.org::Quantifying Regression][2.3. Quantifying Regression]]
   [[./resources/17/ml.org::Improving Model with Tests][2.4. Improving Model with Tests]]
 [[./resources/17/ml.org::Linear Regression Example][3. Linear Regression Example]]
   [[./resources/17/ml.org::Load the Data][3.2. Load the Data]]
   [[./resources/17/ml.org::Assign the data to X and y][3.3. Assign the data to X and y]]
   [[./resources/17/ml.org::Plot the data][3.4. Plot the data]]
   [[./resources/17/ml.org::Split Learn and Test data][3.5. Split Learn and Test data]]
   [[./resources/17/ml.org::Create and Fit the Model][3.6. Create and Fit the Model]]
   [[./resources/17/ml.org::Calculate MSE and R2][3.7. Calculate MSE and R2]]
   [[./resources/17/ml.org::Calculate R2 Score][3.8. Calculate R2 Score]]
   [[./resources/17/ml.org::Conclusion][3.9. Conclusion]]
 [[./resources/17/ml.org::Logistic Regression][4. Logistic Regression]]
   [[./resources/17/ml.org::Logistic regression in python][4.2. Logistic regression in python]]
 [[./resources/17/ml.org::Logistic Regression Example][5. Logistic Regression Example]]
   [[./resources/17/ml.org::Imports][5.2. Imports]]
   [[./resources/17/ml.org::Load the data][5.3. Load the data]]
   [[./resources/17/ml.org::Assign data][5.4. Assign data]]
   [[./resources/17/ml.org::Init and train the data][5.5. Init and train the data]]
   [[./resources/17/ml.org::Make predictions][5.6. Make predictions]]
   [[./resources/17/ml.org::Evaluate model][5.7. Evaluate model]]
   [[./resources/17/ml.org::Storing the Model][5.8. Storing the Model]]
   [[./resources/17/ml.org::Reloading the Model][5.9. Reloading the Model]]
 [[./resources/17/ml.org::Confusion Matrix][6. Confusion Matrix]]
   [[./resources/17/ml.org::Measuring Accuracy][6.2. Measuring Accuracy]]
   [[./resources/17/ml.org::Confusion Matrix in Python][6.3. Confusion Matrix in Python]]
 [[./resources/17/ml.org::Support Vector Machine][7. Support Vector Machine]]
   [[./resources/17/ml.org::SVMs in practice][7.2. SVMs in practice]]
 [[./resources/17/ml.org::Decision Trees][8. Decision Trees]]
   [[./resources/17/ml.org::Decision Trees in Python][8.2. Decision Trees in Python]]
   [[./resources/17/ml.org::Aggregation][8.3. Aggregation]]
 [[./resources/17/ml.org::Random Forest by Hand][9. Random Forest by Hand]]
   [[./resources/17/ml.org::Imports][9.2. Imports]]
   [[./resources/17/ml.org::Create Data][9.3. Create Data]]
   [[./resources/17/ml.org::Predict][9.4. Predict]]
   [[./resources/17/ml.org::Bagging][9.5. Bagging]]
   [[./resources/17/ml.org::Random Forest Pre-built][9.6. Random Forest Pre-built]]
   [[./resources/17/ml.org::Ada-Boost Classifier][9.7. Ada-Boost Classifier]]
 [[./resources/17/ml.org::Choosing an Ensemble Model][10. Choosing an Ensemble Model]]
   [[./resources/17/ml.org::Imports][10.2. Imports]]
   [[./resources/17/ml.org::Loading the Data][10.3. Loading the Data]]
   [[./resources/17/ml.org::Creating a Tester function][10.4. Creating a Tester function]]
   [[./resources/17/ml.org::Using the function to compare models][10.5. Using the function to compare models]]
 [[./resources/17/ml.org::Feature Selection with Random Forest][11. Feature Selection with Random Forest]]
   [[./resources/17/ml.org::Imports][11.2. Imports]]
   [[./resources/17/ml.org::Load Data][11.3. Load Data]]
   [[./resources/17/ml.org::Split the Data][11.4. Split the Data]]
   [[./resources/17/ml.org::Creating a first Model][11.5. Creating a first Model]]
   [[./resources/17/ml.org::Using the Features attribute][11.6. Using the Features attribute]]
   [[./resources/17/ml.org::Selecting Features][11.7. Selecting Features]]
   [[./resources/17/ml.org::New Model with the Selected Features][11.8. New Model with the Selected Features]]
   [[./resources/17/ml.org::Evaluating the new Model][11.9. Evaluating the new Model]]
** Unsupervised-ml
 [[./resources/18/unsupervised-ml.org::Unsupervised Machine Learning][1. Unsupervised Machine Learning]]
   [[./resources/18/unsupervised-ml.org::Clustering][1.2. Clustering]]
 [[./resources/18/unsupervised-ml.org::Data preparation][2. Data preparation]]
   [[./resources/18/unsupervised-ml.org::Transformation Example][2.2. Transformation Example]]
   [[./resources/18/unsupervised-ml.org::Data Transformation Example 2][2.3. Data Transformation Example 2]]
 [[./resources/18/unsupervised-ml.org::K-Means Algorithm][3. K-Means Algorithm]]
   [[./resources/18/unsupervised-ml.org::The Elbow Curve][3.2. The Elbow Curve]]
 [[./resources/18/unsupervised-ml.org::K-Cluster Example][4. K-Cluster Example]]
   [[./resources/18/unsupervised-ml.org::Load the Data][4.2. Load the Data]]
   [[./resources/18/unsupervised-ml.org::Convert time to Time Delta][4.3. Convert time to Time Delta]]
   [[./resources/18/unsupervised-ml.org::Clean the data][4.4. Clean the data]]
   [[./resources/18/unsupervised-ml.org::Creating a Training Set][4.5. Creating a Training Set]]
   [[./resources/18/unsupervised-ml.org::Chose Number of Clusters and Predict][4.6. Chose Number of Clusters and Predict]]
   [[./resources/18/unsupervised-ml.org::Visualize the Results][4.7. Visualize the Results]]
   [[./resources/18/unsupervised-ml.org::Organize the Results][4.8. Organize the Results]]
 [[./resources/18/unsupervised-ml.org::Principal Component Analysis][5. Principal Component Analysis]]
 [[./resources/18/unsupervised-ml.org::Example of PCA][6. Example of PCA]]
   [[./resources/18/unsupervised-ml.org::Load the Data][6.2. Load the Data]]
   [[./resources/18/unsupervised-ml.org::Standarize / Scale the data][6.3. Standarize / Scale the data]]
   [[./resources/18/unsupervised-ml.org::Use the PCA][6.4. Use the PCA]]
   [[./resources/18/unsupervised-ml.org::K-means clustering][6.5. K-means clustering]]
   [[./resources/18/unsupervised-ml.org::Visualize the Results][6.6. Visualize the Results]]
 [[./resources/18/unsupervised-ml.org::PCA Example 2][7. PCA Example 2]]
   [[./resources/18/unsupervised-ml.org::Clean the data][7.2. Clean the data]]
   [[./resources/18/unsupervised-ml.org::Applying PCA][7.3. Applying PCA]]
   [[./resources/18/unsupervised-ml.org::Visualize PCA][7.4. Visualize PCA]]
   [[./resources/18/unsupervised-ml.org::Visualize Elbow Curve][7.5. Visualize Elbow Curve]]
   [[./resources/18/unsupervised-ml.org::Select Amount of Clusters and build Model][7.6. Select Amount of Clusters and build Model]]
   [[./resources/18/unsupervised-ml.org::Visualize the Results][7.7. Visualize the Results]]
   [[./resources/18/unsupervised-ml.org::Display summary statistics][7.8. Display summary statistics]]
 [[./resources/18/unsupervised-ml.org::Hierarchical Clustering][8. Hierarchical Clustering]]
   [[./resources/18/unsupervised-ml.org::Dendograms][8.2. Dendograms]]
 [[./resources/18/unsupervised-ml.org::Hierarchical Cluster Example][9. Hierarchical Cluster Example]]
   [[./resources/18/unsupervised-ml.org::Imports][9.2. Imports]]
   [[./resources/18/unsupervised-ml.org::Load and Normalize the Data][9.3. Load and Normalize the Data]]
   [[./resources/18/unsupervised-ml.org::Create the Dendogram][9.4. Create the Dendogram]]
   [[./resources/18/unsupervised-ml.org::Remap Observations into Clusters][9.5. Remap Observations into Clusters]]
   [[./resources/18/unsupervised-ml.org::Run the Dendogram Again][9.6. Run the Dendogram Again]]
** Deeplearning
 [[./resources/19/deeplearning.org::Deep Learning][1. Deep Learning]]
   [[./resources/19/deeplearning.org::Neural Networks][1.2. Neural Networks]]
   [[./resources/19/deeplearning.org::Perceptrons][1.3. Perceptrons]]
 [[./resources/19/deeplearning.org::Neural Networks in Python][2. Neural Networks in Python]]
   [[./resources/19/deeplearning.org::Tensorflow and Keras][2.2. Tensorflow and Keras]]
   [[./resources/19/deeplearning.org::Imports][2.3. Imports]]
   [[./resources/19/deeplearning.org::Generate Data][2.4. Generate Data]]
   [[./resources/19/deeplearning.org::Prepare the Data][2.5. Prepare the Data]]
   [[./resources/19/deeplearning.org::Create and Layer the Model][2.6. Create and Layer the Model]]
   [[./resources/19/deeplearning.org::Train the model][2.7. Train the model]]
   [[./resources/19/deeplearning.org::Visualize the Results][2.8. Visualize the Results]]
   [[./resources/19/deeplearning.org::Evaluate the Model][2.9. Evaluate the Model]]
   [[./resources/19/deeplearning.org::Re-training the model][2.10. Re-training the model]]
 [[./resources/19/deeplearning.org::Neural Network Example 2][3. Neural Network Example 2]]
   [[./resources/19/deeplearning.org::Imports][3.2. Imports]]
   [[./resources/19/deeplearning.org::Load Data][3.3. Load Data]]
   [[./resources/19/deeplearning.org::Create and Layer the Model][3.4. Create and Layer the Model]]
   [[./resources/19/deeplearning.org::Compile and Train the Model][3.5. Compile and Train the Model]]
   [[./resources/19/deeplearning.org::Evaluate the Model][3.6. Evaluate the Model]]
   [[./resources/19/deeplearning.org::Visualize the Results][3.7. Visualize the Results]]
   [[./resources/19/deeplearning.org::Re-training the Model][3.8. Re-training the Model]]
 [[./resources/19/deeplearning.org::Encoding Data][4. Encoding Data]]
   [[./resources/19/deeplearning.org::Get Frequencies][4.2. Get Frequencies]]
   [[./resources/19/deeplearning.org::One Hot Encoder][4.3. One Hot Encoder]]
   [[./resources/19/deeplearning.org::Standarize the Data][4.4. Standarize the Data]]
 [[./resources/19/deeplearning.org::Neural Network Example 3][5. Neural Network Example 3]]
   [[./resources/19/deeplearning.org::Load the Data][5.2. Load the Data]]
   [[./resources/19/deeplearning.org::Prepare the data][5.3. Prepare the data]]
   [[./resources/19/deeplearning.org::Create the Model][5.4. Create the Model]]
   [[./resources/19/deeplearning.org::Compile and Fit the Model][5.5. Compile and Fit the Model]]
   [[./resources/19/deeplearning.org::Evaluate the Model][5.6. Evaluate the Model]]
   [[./resources/19/deeplearning.org::Re-create the Model, No Free Lunch!][5.7. Re-create the Model, No Free Lunch!]]
   [[./resources/19/deeplearning.org::Evaluate the Model][5.8. Evaluate the Model]]
 [[./resources/19/deeplearning.org::Addressing Overfitting and Underfitting][6. Addressing Overfitting and Underfitting]]
   [[./resources/19/deeplearning.org::Getting Rid of Outliers][6.2. Getting Rid of Outliers]]
   [[./resources/19/deeplearning.org::Work with Hyperparameters][6.3. Work with Hyperparameters]]
 [[./resources/19/deeplearning.org::Model Optimization and Keras Tuner][7. Model Optimization and Keras Tuner]]
   [[./resources/19/deeplearning.org::Imports][7.2. Imports]]
   [[./resources/19/deeplearning.org::Prepare the Data][7.3. Prepare the Data]]
   [[./resources/19/deeplearning.org::Visualize the Data][7.4. Visualize the Data]]
   [[./resources/19/deeplearning.org::Create a Factory Function][7.5. Create a Factory Function]]
   [[./resources/19/deeplearning.org::Use Keras Tuner][7.6. Use Keras Tuner]]
   [[./resources/19/deeplearning.org::Get the Best Model][7.7. Get the Best Model]]
 [[./resources/19/deeplearning.org::Footnotes][8. Footnotes]]
