data.md
- [Index](#orgd9a59e2)


<a id="orgd9a59e2"></a>

# Index

[1. Unsupervised Machine Learning](./resources/unsupervised-ml.md)

[1.2. Clustering](./resources/unsupervised-ml.md)

[2. Data preparation](./resources/unsupervised-ml.md)

[2.2. Transformation Example](./resources/unsupervised-ml.md)

[2.3. Data Transformation Example 2](./resources/unsupervised-ml.md)

[3. K-Means Algorithm](./resources/unsupervised-ml.md)

[3.2. The Elbow Curve](./resources/unsupervised-ml.md)

[4. K-Cluster Example](./resources/unsupervised-ml.md)

[4.2. Load the Data](./resources/unsupervised-ml.md)

[4.3. Convert time to Time Delta](./resources/unsupervised-ml.md)

[4.4. Clean the data](./resources/unsupervised-ml.md)

[4.5. Creating a Training Set](./resources/unsupervised-ml.md)

[4.6. Chose Number of Clusters and Predict](./resources/unsupervised-ml.md)

[4.7. Visualize the Results](./resources/unsupervised-ml.md)

[4.8. Organize the Results](./resources/unsupervised-ml.md)

[5. Principal Component Analysis](./resources/unsupervised-ml.md)

[6. Example of PCA](./resources/unsupervised-ml.md)

[6.2. Load the Data](./resources/unsupervised-ml.md)

[6.3. Standarize / Scale the data](./resources/unsupervised-ml.md)

[6.4. Use the PCA](./resources/unsupervised-ml.md)

[6.5. K-means clustering](./resources/unsupervised-ml.md)

[6.6. Visualize the Results](./resources/unsupervised-ml.md)

[7. PCA Example 2](./resources/unsupervised-ml.md)

[7.2. Clean the data](./resources/unsupervised-ml.md)

[7.3. Applying PCA](./resources/unsupervised-ml.md)

[7.4. Visualize PCA](./resources/unsupervised-ml.md)

[7.5. Visualize Elbow Curve](./resources/unsupervised-ml.md)

[7.6. Select Amount of Clusters and build Model](./resources/unsupervised-ml.md)

[7.7. Visualize the Results](./resources/unsupervised-ml.md)

[7.8. Display summary statistics](./resources/unsupervised-ml.md)

[8. Hierarchical Clustering](./resources/unsupervised-ml.md)

[8.2. Dendograms](./resources/unsupervised-ml.md)

[9. Hierarchical Cluster Example](./resources/unsupervised-ml.md)

[9.2. Imports](./resources/unsupervised-ml.md)

[9.3. Load and Normalize the Data](./resources/unsupervised-ml.md)

[9.4. Create the Dendogram](./resources/unsupervised-ml.md)

[9.5. Remap Observations into Clusters](./resources/unsupervised-ml.md)

[9.6. Run the Dendogram Again](./resources/unsupervised-ml.md)

[1. Deep Learning](./resources/deeplearning.md)

[1.2. Neural Networks](./resources/deeplearning.md)

[1.3. Perceptrons](./resources/deeplearning.md)

[2. Neural Networks in Python](./resources/deeplearning.md)

[2.2. Tensorflow and Keras](./resources/deeplearning.md)

[2.3. Imports](./resources/deeplearning.md)

[2.4. Generate Data](./resources/deeplearning.md)

[2.5. Prepare the Data](./resources/deeplearning.md)

[2.6. Create and Layer the Model](./resources/deeplearning.md)

[2.7. Train the model](./resources/deeplearning.md)

[2.8. Visualize the Results](./resources/deeplearning.md)

[2.9. Evaluate the Model](./resources/deeplearning.md)

[2.10. Re-training the model](./resources/deeplearning.md)

[3. Neural Network Example 2](./resources/deeplearning.md)

[3.2. Imports](./resources/deeplearning.md)

[3.3. Load Data](./resources/deeplearning.md)

[3.4. Create and Layer the Model](./resources/deeplearning.md)

[3.5. Compile and Train the Model](./resources/deeplearning.md)

[3.6. Evaluate the Model](./resources/deeplearning.md)

[3.7. Visualize the Results](./resources/deeplearning.md)

[3.8. Re-training the Model](./resources/deeplearning.md)

[4. Encoding Data](./resources/deeplearning.md)

[4.2. Get Frequencies](./resources/deeplearning.md)

[4.3. One Hot Encoder](./resources/deeplearning.md)

[4.4. Standarize the Data](./resources/deeplearning.md)

[5. Neural Network Example 3](./resources/deeplearning.md)

[5.2. Load the Data](./resources/deeplearning.md)

[5.3. Prepare the data](./resources/deeplearning.md)

[5.4. Create the Model](./resources/deeplearning.md)

[5.5. Compile and Fit the Model](./resources/deeplearning.md)

[5.6. Evaluate the Model](./resources/deeplearning.md)

[5.7. Re-create the Model, No Free Lunch!](./resources/deeplearning.md)

[5.8. Evaluate the Model](./resources/deeplearning.md)

[6. Addressing Overfitting and Underfitting](./resources/deeplearning.md)

[6.2. Getting Rid of Outliers](./resources/deeplearning.md)

[6.3. Work with Hyperparameters](./resources/deeplearning.md)

[7. Model Optimization and Keras Tuner](./resources/deeplearning.md)

[7.2. Imports](./resources/deeplearning.md)

[7.3. Prepare the Data](./resources/deeplearning.md)

[7.4. Visualize the Data](./resources/deeplearning.md)

[7.5. Create a Factory Function](./resources/deeplearning.md)

[7.6. Use Keras Tuner](./resources/deeplearning.md)

[7.7. Get the Best Model](./resources/deeplearning.md)

[8. Footnotes](./resources/deeplearning.md)

[1. Machine Learning](./resources/ml.md)

[1.2. Supervised Learning](./resources/ml.md)

[1.3. Linear regression](./resources/ml.md)

[2. Scikit-learn](./resources/ml.md)

[2.2. Univariate Linear Regression](./resources/ml.md)

[2.3. Quantifying Regression](./resources/ml.md)

[2.4. Improving Model with Tests](./resources/ml.md)

[3. Linear Regression Example](./resources/ml.md)

[3.2. Load the Data](./resources/ml.md)

[3.3. Assign the data to X and y](./resources/ml.md)

[3.4. Plot the data](./resources/ml.md)

[3.5. Split Learn and Test data](./resources/ml.md)

[3.6. Create and Fit the Model](./resources/ml.md)

[3.7. Calculate MSE and R2](./resources/ml.md)

[3.8. Calculate R2 Score](./resources/ml.md)

[3.9. Conclusion](./resources/ml.md)

[4. Logistic Regression](./resources/ml.md)

[4.2. Logistic regression in python](./resources/ml.md)

[5. Logistic Regression Example](./resources/ml.md)

[5.2. Imports](./resources/ml.md)

[5.3. Load the data](./resources/ml.md)

[5.4. Assign data](./resources/ml.md)

[5.5. Init and train the data](./resources/ml.md)

[5.6. Make predictions](./resources/ml.md)

[5.7. Evaluate model](./resources/ml.md)

[5.8. Storing the Model](./resources/ml.md)

[5.9. Reloading the Model](./resources/ml.md)

[6. Confusion Matrix](./resources/ml.md)

[6.2. Measuring Accuracy](./resources/ml.md)

[6.3. Confusion Matrix in Python](./resources/ml.md)

[7. Support Vector Machine](./resources/ml.md)

[7.2. SVMs in practice](./resources/ml.md)

[8. Decision Trees](./resources/ml.md)

[8.2. Decision Trees in Python](./resources/ml.md)

[8.3. Aggregation](./resources/ml.md)

[9. Random Forest by Hand](./resources/ml.md)

[9.2. Imports](./resources/ml.md)

[9.3. Create Data](./resources/ml.md)

[9.4. Predict](./resources/ml.md)

[9.5. Bagging](./resources/ml.md)

[9.6. Random Forest Pre-built](./resources/ml.md)

[9.7. Ada-Boost Classifier](./resources/ml.md)

[10. Choosing an Ensemble Model](./resources/ml.md)

[10.2. Imports](./resources/ml.md)

[10.3. Loading the Data](./resources/ml.md)

[10.4. Creating a Tester function](./resources/ml.md)

[10.5. Using the function to compare models](./resources/ml.md)

[11. Feature Selection with Random Forest](./resources/ml.md)

[11.2. Imports](./resources/ml.md)

[11.3. Load Data](./resources/ml.md)

[11.4. Split the Data](./resources/ml.md)

[11.5. Creating a first Model](./resources/ml.md)

[11.6. Using the Features attribute](./resources/ml.md)

[11.7. Selecting Features](./resources/ml.md)

[11.8. New Model with the Selected Features](./resources/ml.md)

[11.9. Evaluating the new Model](./resources/ml.md)